trunk/fireFoam/testBatteryFireFOAM/counterFlowMixing2D/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allclean

runApplication blockMesh

# Run
runApplication fireFoam

# -----------------------------------------------------------------------------
